#### Terraform Format and Style :pencil2: :white_check_mark: **Success**
#### Terraform Validate :hammer_and_wrench: :white_check_mark: **Success**
#### TFLint Check :shirt: :white_check_mark: **Success**
#### Trivy Scan :shield: :white_check_mark: **Success**
#### Terraform Plan :page_facing_up: :white_check_mark: **Success**
---
### Terraform Plan
<details><summary>Click to expand</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.application-autoscaling.aws_appautoscaling_policy.ecs_cpu_target will be created
  + resource "aws_appautoscaling_policy" "ecs_cpu_target" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "sample-prod-frontend-ecs-cpu-target"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/sample-prod-frontend-ecs-cluster/sample-prod-frontend-svc"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 300
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.application-autoscaling.aws_appautoscaling_policy.ecs_memory_target will be created
  + resource "aws_appautoscaling_policy" "ecs_memory_target" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "sample-prod-frontend-ecs-memory-target"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/sample-prod-frontend-ecs-cluster/sample-prod-frontend-svc"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 300
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.application-autoscaling.aws_appautoscaling_target.ecs_service will be created
  + resource "aws_appautoscaling_target" "ecs_service" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 3
      + min_capacity       = 2
      + resource_id        = "service/sample-prod-frontend-ecs-cluster/sample-prod-frontend-svc"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "iac" = "terraform"
        }
    }

  # module.application-autoscaling.aws_iam_service_linked_role.ecs_service_autoscaling will be created
  + resource "aws_iam_service_linked_role" "ecs_service_autoscaling" {
      + arn              = (known after apply)
      + aws_service_name = "ecs.application-autoscaling.amazonaws.com"
      + create_date      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + tags_all         = {
          + "iac" = "terraform"
        }
      + unique_id        = (known after apply)
    }

  # module.codedeploy.aws_codedeploy_deployment_group.my_deployment_group will be created
  + resource "aws_codedeploy_deployment_group" "my_deployment_group" {
      + app_name                    = "sample-prod-frontend-app"
      + arn                         = (known after apply)
      + compute_platform            = (known after apply)
      + deployment_config_name      = "CodeDeployDefault.ECSAllAtOnce"
      + deployment_group_id         = (known after apply)
      + deployment_group_name       = "example"
      + id                          = (known after apply)
      + outdated_instances_strategy = "UPDATE"
      + service_role_arn            = "arn:aws:iam::551748907504:role/sample-prod-frontend-codedeploy-service-role"
      + tags_all                    = {
          + "iac" = "terraform"
        }

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout = "CONTINUE_DEPLOYMENT"
            }
          + green_fleet_provisioning_option (known after apply)
          + terminate_blue_instances_on_deployment_success {
              + action                           = "TERMINATE"
              + termination_wait_time_in_minutes = 5
            }
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }

      + ecs_service {
          + cluster_name = "sample-prod-frontend-ecs-cluster"
          + service_name = "sample-prod-frontend-svc"
        }

      + load_balancer_info {
          + target_group_pair_info {
              + prod_traffic_route {
                  + listener_arns = [
                      + "arn:aws:elasticloadbalancing:ap-northeast-1:551748907504:listener/app/sample-prod-frontend-ecs-alb/b4ea0705384712e3/5889a71822c9b436",
                    ]
                }
              + target_group {
                  + name = "webecs20240822015830131000000008"
                }
              + target_group {
                  + name = "webecs2024082201583014740000000a"
                }
              + test_traffic_route {
                  + listener_arns = [
                      + "arn:aws:elasticloadbalancing:ap-northeast-1:551748907504:listener/app/sample-prod-frontend-ecs-alb/b4ea0705384712e3/b5ee7519149d7006",
                    ]
                }
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>